<?php
  ////////////////////////////////////////////////////////////
  // 2006-2007 (C) Кузнецов М.В., Симдянов И.В.
  // Объектно ориентированное программирование на PHP
  // IT-студия SoftTime (http://www.softtime.ru)
  ////////////////////////////////////////////////////////////
  // Выставляем уровень обработки ошибок 
  // (http://www.softtime.ru/info/articlephp.php?id_article=23)
  error_reporting(E_ALL & ~E_NOTICE);
  ////////////////////////////////////////////////////////////
  // Скрытое поле с целочисленными значениями hidden
  ////////////////////////////////////////////////////////////

  class field_hidden_int extends field_hidden
  {
    // Метод, проверяющий корректность переданных данных
    function check()
    {
      if($this->is_required)
      {
        // Поле обязательно к заполнению
        if(!preg_match("|^[\d]+$|",$this->value))
        {
          return "Скрытое поле должно быть целым числом";
        }
      }
      // Поле не обязательно к заполнению
      if(!preg_match("|^[\d]*$|",$this->value))
      {
        return "Скрытое поле должно быть целым числом";
      }

      return "";
    }
  }
?>