<?php
  ////////////////////////////////////////////////////////////
  // 2006-2007 (C) Кузнецов М.В., Симдянов И.В.
  // Объектно ориентированное программирование на PHP
  // IT-студия SoftTime (http://www.softtime.ru)
  ////////////////////////////////////////////////////////////
  // Выставляем уровень обработки ошибок 
  // (http://www.softtime.ru/info/articlephp.php?id_article=23)
  error_reporting(E_ALL & ~E_NOTICE);
  // Подключаем реализацию класса
  require_once("class.cls.php");

  // Инициируем сессию
  session_start();

  // Создаем объект
  $obj = new cls(100);

  // Помещаем объект в сессию
  $_SESSION['obj'] = serialize($obj);

  // Переход на вторую страницу
  echo "<a href=index1.php>ссылка</a>";
?>
