<?php
  ////////////////////////////////////////////////////////////
  // 2006-2007 (C) Кузнецов М.В., Симдянов И.В.
  // Объектно ориентированное программирование на PHP
  // IT-студия SoftTime (http://www.softtime.ru)
  ////////////////////////////////////////////////////////////
  // Выставляем уровень обработки ошибок 
  // (http://www.softtime.ru/info/articlephp.php?id_article=23)
  error_reporting(E_ALL & ~E_NOTICE);
  // Указывать тип переменной не обязательно
  $str = "Hello world!";
  $var = "test";
  // Создаем переменную $test с содержимым "Hello world"
  $$var = $str;
  echo $test;
  // Изменяем тип переменной на числовой
  $var = 5;
  echo "<br>$var";
?>
